4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Inc/stm32mp2xx_ll_bsec.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_bsec.h
  * @author  MCD Application Team
  * @brief   Header file of BSEC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_LL_BSEC_H
#define STM32MP2xx_LL_BSEC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"
#include "stm32mp2xx_ll_bsec.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined(BSEC)

/** @defgroup BSEC_LL BSEC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/


#define LL_BSEC_OTP_NB_WORDS                (uint32_t)(384)
#define LL_BSEC_OTP_WORD_INDEX_MAX          (uint32_t)(LL_BSEC_OTP_NB_WORDS-1)

#define LL_BSEC_OTP_LOWER_FIRST_WORD_INDEX  (uint32_t)(0)
#define LL_BSEC_OTP_LOWER_LAST_WORD_INDEX   (uint32_t)(127)

#define LL_BSEC_OTP_MIDDLE_FIRST_WORD_INDEX (uint32_t)(128)
#define LL_BSEC_OTP_MIDDLE_LAST_WORD_INDEX  (uint32_t)(255)

#define LL_BSEC_OTP_UPPER_FIRST_WORD_INDEX  (uint32_t)(256)
#define LL_BSEC_OTP_UPPER_LAST_WORD_INDEX   LL_BSEC_OTP_WORD_INDEX_MAX

#define LL_BSEC_SR_NVSTATE_B_0x16           0x16 /* 6b010110' */
#define LL_BSEC_SR_NVSTATE_B_0xD            0x0D /* 6b001101' */

/* Possible valid values of 'BSEC_SR.STATE' field */
#define LL_BSEC_SECURITY_STATE_OPEN        LL_BSEC_SR_NVSTATE_B_0x16 /* 0x16 = 6b010110' */
#define LL_BSEC_SECURITY_STATE_CLOSED      LL_BSEC_SR_NVSTATE_B_0xD  /* 0x0D = 6b001101' */

/* Possible sticky 'lock type' in BSEC : value have to be possibly combined in a mask */
#define LL_BSEC_STICKY_NOT_LOCKED          (0)
#define LL_BSEC_STICKY_PROG_LOCKED         (1 << 0)
#define LL_BSEC_STICKY_WRITE_LOCKED        (1 << 1)
#define LL_BSEC_STICKY_READ_LOCKED         (1 << 2)

/* Magic number value of register 'BSEC_UNMAPR' that says all ROM is currently mapped */
#define LL_BSEC_ROM_IS_FULLY_MAPPED_MAGIC  0xA1C0DE0D
#define LL_BSEC_ROM_IS_PARTIALLY_UNMAPPED  0xFFFFFFFF

/* Possible values returned by function 'LL_BSEC_Is_Rom_FullyMapped()' */
#define LL_BSEC_ROM_FULLY_MAPPED            1
#define LL_BSEC_ROM_PARTIAL_UNMAPPED        2
#define LL_BSEC_ROM_UNMAP_INVALID           3

/* Check word : OTP_HW_WORD0 reference value to be programmed in EWS when */
/* switching from virgin -> non virgin                                    */
#define LL_BSEC_CHECK_WORD_REF_VALUE        0xAAAA5555

/* Mask of field 'OTP_HW_WORD4.tk_retries' */
#define LL_BSEC_TK_RETRIES_MASK             0x0000FFFF
#define LL_BSEC_TK_RETRIES_BYTE3_MASK       0x0000F000
#define LL_BSEC_TK_RETRIES_START_BIT_POS    0

/* possible values of parameter 'prog' of function LL_BSEC_Set_OtpCtrl() */
#define LL_BSEC_OTPCR_PROG_BIT_IS_READ_REQ      0
#define LL_BSEC_OTPCR_PROG_BIT_IS_PROGRAM_REQ   1

/* possible values of parameter 'lock' of function LL_BSEC_Set_OtpCtrl() */
#define LL_BSEC_OTPCR_LOCK_BIT_IS_NOLOCK_REQ    0
#define LL_BSEC_OTPCR_LOCK_BIT_IS_LOCK_REQ      1

#define LL_BSEC_DENR_Pos         (0U)
#define LL_BSEC_DENR_Msk         (0x0000FFFF)


/*
 * Feature disabling word OTP_FEATURE_DISABLING bit definitions
 */

#define LL_BSEC_FEATURE_DISABLING_WORD_NB                   9

#define LL_BSEC_FEATURE_DISABLED_DUAL_CA35                  (1<<0)
#define LL_BSEC_FEATURE_DISABLED_CM0_PLUS                   (1<<1)
#define LL_BSEC_FEATURE_DISABLED_GPU                        (1<<2)
#define LL_BSEC_FEATURE_DISABLED_DSI                        (1<<3)
#define LL_BSEC_FEATURE_DISABLED_CSI                        (1<<4)
#define LL_BSEC_FEATURE_DISABLED_DUAL_ETH_GMAC              (1<<5)
#define LL_BSEC_FEATURE_DISABLED_FDCAN                      (1<<6)
#define LL_BSEC_FEATURE_DISABLED_USB3                       (1<<7)
#define LL_BSEC_FEATURE_DISABLED_PCIE                       (1<<8)
#define LL_BSEC_FEATURE_DISABLED_CRYPTO_CRYP_SAES_PKA_FULL  (1<<9)
#define LL_BSEC_FEATURE_DISABLED_DDRCRYP                    (1<<10)
#define LL_BSEC_FEATURE_DISABLED_OTFDEC                     (1<<11)
#define LL_BSEC_FEATURE_DISABLED_LVDS                       (1<<12)
#define LL_BSEC_FEATURE_DISABLED_RNG                        (1<<13)
#define LL_BSEC_FEATURE_DISABLED_RESERVED_FUTURE1           (1<<14) /* reserved for future use 1 */
#define LL_BSEC_FEATURE_DISABLED_RESERVED_FUTURE2           (1<<15) /* reserved for future use 2 */
#define LL_BSEC_FEATURE_DISABLED_GPU_NN_EXTENSION           (1<<16)
#define LL_BSEC_FEATURE_DISABLED_VDEC_VENC                  (1<<17)
#define LL_BSEC_FEATURE_DISABLED_CA35_AARCH64_BOOT          (1<<18)
#define LL_BSEC_FEATURE_DISABLED_ETHSW                      (1<<19) /* TSN switch */

/* Number of feature disable bits effectively used */
#define LL_BSEC_FEATURE_DISABLED_NB_BITS_USED             20

/* 'ECIES_CHIP_PRIVK_ENC' is on 256 bits = 8 words like 'ECIES_CHIP_PRIVK' */
#define LL_BSEC_NB_ENC_ECIES_WORDS                          8

/* 'HWKEY' is on 256 bits = 8 words  */
#define LL_BSEC_NB_HWKEY_WORDS                              8

/* 4 warm reset resistant scratch words BSEC_SCRATCHR0..3 in SoC */
#define LL_BSEC_NB_WARM_RESET_SCRATCH_REG                   4

/* 8 hot reset resistant scratch words BSEC_WOSCR0..7 in SoC */
#define LL_BSEC_NB_HOT_RESET_SCRATCH_REG                    8

