4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Inc/stm32mp2xx_ll_bsec.h
/**
  * @brief  Get field 'OTP_HW_WORD0' : is always shadowed on SoC, so get
  *         value from BSEC_FVR0 shadow register.
  *
  * @Note   Useful for bootROM to verify validity of check word against normal value :
  *         LL_BSEC_CHECK_WORD_REF_VALUE.
  *
  * @param  BSECx : pointer on BSEC HW instance
  *
  * @retval : value read in BSEC_FVR0 register.
  */
__STATIC_INLINE uint32_t LL_BSEC_Get_OTP_CheckWord(BSEC_TypeDef * BSECx)
{
  return READ_REG(BSECx->FVRx[0]);
}

/**
  * @brief  Get field 'OTP_HW_WORD4.tk_retries' : is always shadowed on SoC, so get
  *         value from BSEC_FVR4.tk_retries shadow register field.
  *
  * @Note   Useful to know if ECIES have already be provisioned on a given sample.
  *
  * @param  BSECx : pointer on BSEC HW instance
  *
  * @retval : value read in field 'BSEC_FVR4.tk_retries'.
  */
__STATIC_INLINE uint32_t LL_BSEC_Get_OTP_TkRetries(BSEC_TypeDef * BSECx)
{
  return(((READ_REG(BSECx->FVRx[4]) & LL_BSEC_TK_RETRIES_MASK) >> LL_BSEC_TK_RETRIES_START_BIT_POS));
}

/**
  * @brief  Low level function to simply
  *         write in register 'BSEC_ENCKEYRx' (where x = wordIdx parameter < 8),
  *         a TK encrypted form of an ECIES_CHIP_PRIVK word (namely ECIES_CHIP_PRIVK_ENCx value).
  *
  * @Note1   Useful in ECIES provisioning stage in EWS.
  *
  * @Note2   WARNING : There is no verification if the BSEC Wrapper is currently BUSY before proceeding,
  *          to the write herein, neither if the sample is in BSEC CLOSED state to make a write effective, neither if
  *          all TK RETRIES are already burnt. All these necessary verification are to be done
  *          externally by SW before calling this function.
  *
  * @param[in] BSECx     : pointer on BSEC HW instance
  * @param[in] wordIdx   : the x of 'BSEC_ENCKEYRx' register, ie its instance, hence
  *                       ECIES Encrypted form word index of ECIES_CHIP_PRIVK_ENC.
  * @param[in] wordValue : The word value to be written in 'BSEC_ENCKEYRx' register
  *
  * @retval : None.
  */
__STATIC_INLINE void LL_BSEC_Write_OTP_EncEcies_Word(BSEC_TypeDef * BSECx, uint32_t wordIdx, uint32_t wordValue)
{
  uint32_t * pEncKeyReg = (uint32_t*)((uint32_t)&BSECx->ENCKEYR0 + (wordIdx * 4));

  if(wordIdx < LL_BSEC_NB_ENC_ECIES_WORDS)
  {
    * pEncKeyReg = wordValue;
  }
}

/**
  * @brief  Low level function to simply
  *         make Hw process 'HWKEY' in BSEC generate from RNG a new random word, verify and fuse it in
  *         OTP word n = 376 + (wordIdx mod 8).
  *         The process needs to be called externally 8 times to have all HWKEY ready in OTP upper
  *         OTP_CFG376..383.
  *         Each time it write 'BSEC_HWKEYR.INDEX[2:0]' = wordIdx from second parameter (0..7), this lead
  *         to generation of OTP word n = 376 + (wordIdx mod 8) with a Random Number got from RNG.
  *
  * @Note1   Useful in HWKEY provisioning stage in EWS.
  *
  * @Note2   WARNING : There is no verification if the BSEC Wrapper is currently BUSY before proceeding,
  *          to the write herein, neither if the sample is in BSEC CLOSED state to make a write effective, neither if
  *          the RNG Hw block is clocked in RCC and ready (entropy).
  *          All these necessary verification are to be done externally before calling this function.
  *
  * @param  BSECx   : pointer on BSEC HW instance
  * @param  wordIdx : to generate HWKEYx word where x == 'wordIdx' from RNG bus (wordIdx = 0..7).
  *
  * @retval : None.
  */
__STATIC_INLINE void LL_BSEC_Write_OTP_HwKey_Word(BSEC_TypeDef * BSECx, uint32_t wordIdx)
{
  if(wordIdx < LL_BSEC_NB_HWKEY_WORDS)
  {
    MODIFY_REG(BSECx->HWKEYR,BSEC_HWKEYR_INDEX,wordIdx << BSEC_HWKEYR_INDEX_Pos);
  }
}

/**
  * @brief  Get field 'BSEC_WRCR.WRC' : this is a counter of 'warm resets' (BSEC 'rst_n')
  *         since last 'scratch_rst_n'.
  *
  * @param  BSECx : pointer on BSEC HW instance
  *
  * @retval : returns, the number of warm resets (rst_n only),
  *           since the last cold reset (scratch_rst_n).
  */
__STATIC_INLINE uint32_t LL_BSEC_Get_WarmRstCounter(BSEC_TypeDef * BSECx)
{
  return(READ_REG(BSECx->WRCR));
}

/**
  * @brief  Get field 'BSEC_HRCR.HRC' : this is a counter of 'hot resets' (BSEC 'hot_rst_n')
  *         since last 'scratch_rst_n' (cold) or 'rst_n' (warm) resets.
  *
  * @param  BSECx : pointer on BSEC HW instance
  *
  * @retval : returns, the number of hot resets,
  *           since the last warm or cold reset.
  */
__STATIC_INLINE uint32_t LL_BSEC_Get_HotRstCounter(BSEC_TypeDef * BSECx)
{
  return(READ_REG(BSECx->HRCR));
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)

/**
  * @}
  */

uint32_t LL_BSEC_Is_StickyLocked(BSEC_TypeDef * BSECx, uint32_t otpWordNb, uint32_t lockTypeToTest);
void     LL_BSEC_Set_StickyLock(BSEC_TypeDef * BSECx, uint32_t otpWordNb, uint32_t lockType);
void     LL_BSEC_Set_OtpCtrl(BSEC_TypeDef * BSECx, uint32_t otpWordNb, uint32_t prog, uint32_t lock);
uint32_t LL_BSEC_Is_Rom_FullyMapped(BSEC_TypeDef * BSECx);
uint32_t LL_BSEC_Is_ShadowedOtpReloadedInShadowValid(BSEC_TypeDef * BSECx, uint32_t otpWordNb);
uint32_t LL_BSEC_Is_Shadowed(BSEC_TypeDef * BSECx, uint32_t otpWordNb);
uint32_t LL_BSEC_Get_WarmResetPersistScratch(BSEC_TypeDef * BSECx, uint32_t scratchWordNb);
void     LL_BSEC_Write_WarmResetPersistScratchWord(BSEC_TypeDef * BSECx, uint32_t scratchWordNb, uint32_t value);
uint32_t LL_BSEC_Get_HotResetPersistScratch(BSEC_TypeDef * BSECx, uint32_t scratchWordNb);
void     LL_BSEC_Write_HotResetPersistScratchWord(BSEC_TypeDef * BSECx, uint32_t scratchWordNb, uint32_t value);
void     LL_BSEC_Set_OtpCtrl(BSEC_TypeDef * BSECx, uint32_t otpWordNb, uint32_t prog, uint32_t lock);

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

#endif /* defined(BSEC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_LL_BSEC_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

